## Gather

In [1]:
import pandas as pd
import numpy as np

In [2]:
patients = pd.read_csv('patients.csv')
treatments = pd.read_csv('treatments.csv')
adverse_reactions = pd.read_csv('adverse_reactions.csv')

## Assess

In [3]:
patients.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 503 entries, 0 to 502
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   patient_id    503 non-null    int64
 1   assigned_sex  503 non-null    object
 2   given_name    503 non-null    object
 3   surname       503 non-null    object
 4   address       491 non-null    object
 5   city          491 non-null    object
 6   state         491 non-null    object
 7   zip_code      491 non-null    float64
 8   country       491 non-null    object
 9   contact       491 non-null    object
 10  birthdate     503 non-null    object
 11  weight        503 non-null    float64
 12  height        503 non-null    int64
 13  bmi           503 non-null    float64
dtypes: float64(3), int64(2), object(9)
memory usage: 55.1+ KB

In [4]:
treatments.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 280 entries, 0 to 279
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   given_name    280 non-null    object
 1   surname       280 non-null    object
 2   auralin       280 non-null    object
 3   novodra       280 non-null    object
 4   hba1c_start   280 non-null    float64
 5   hba1c_end     280 non-null    float64
 6   hba1c_change  171 non-null    float64
dtypes: float64(3), object(4)
memory usage: 15.4+ KB

In [5]:
adverse_reactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   given_name        34 non-null     object
 1   surname           34 non-null     object
 2   adverse_reaction  34 non-null     object
dtypes: object(3)
memory usage: 944.0+ bytes

In [6]:
all_columns = pd.Series(list(patients) + list(treatments) + list(adverse_reactions))
all_columns[all_columns.duplicated()]

14    given_name
15       surname
21    given_name
22       surname
dtype: object

In [7]:
list(patients)

['patient_id',
 'assigned_sex',
 'given_name',
 'surname',
 'address',
 'city',
 'state',
 'zip_code',
 'country',
 'contact',
 'birthdate',
 'weight',
 'height',
 'bmi']

In [8]:
patients[patients['address'].isnull()]

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,contact,birthdate,weight,height,bmi
209,210,female,Lalita,Eldarkhanov,NaN,NaN,NaN,NaN,NaN,NaN,8/14/1950,143.4,62,26.2
219,220,male,Mỹ,Quynh,NaN,NaN,NaN,NaN,NaN,NaN,4/9/1978,237.8,69,35.1
230,231,female,Elisabeth,Knudsen,NaN,NaN,NaN,NaN,NaN,NaN,9/23/1976,165.9,63,29.4
234,235,female,Martina,Tománková,NaN,NaN,NaN,NaN,NaN,NaN,4/7/1936,199.5,65,33.2
242,243,male,John,O'Brian,NaN,NaN,NaN,NaN,NaN,NaN,2/25/1957,205.3,74,26.4
249,250,male,Benjamin,Mehler,NaN,NaN,NaN,NaN,NaN,NaN,10/30/1951,146.5,69,21.6
257,258,male,Jin,Kung,NaN,NaN,NaN,NaN,NaN,NaN,5/17/1995,231.7,69,34.2
264,265,female,Wafiyyah,Asfour,NaN,NaN,NaN,NaN,NaN,NaN,11/3/1989,158.6,63,28.1
269,270,female,Flavia,Fiorentino,NaN,NaN,NaN,NaN,NaN,NaN,10/9/1937,175.2,61,33.1
278,279,female,Generosa,Cabán,NaN,NaN,NaN,NaN,NaN,NaN,12/16/1962,124.3,69,18.4
286,287,male,Lewis,Webb,NaN,NaN,NaN,NaN,NaN,NaN,4/1/1979,155.3,68,23.6
296,297,female,Chỉ,Lâm,NaN,NaN,NaN,NaN,NaN,NaN,5/14/1990,181.1,63,32.1

In [9]:
patients.describe()

       patient_id      zip_code      weight      height         bmi
count  503.000000    491.000000  503.000000  503.000000  503.000000
mean   252.000000  49084.118126  173.434990   66.634195   27.483897
std    145.347859  30265.807442   33.916741    4.411297    5.276438
min      1.000000   1002.000000   48.800000   27.000000   17.100000
25%    126.500000  21920.500000  149.300000   63.000000   23.300000
50%    252.000000  48057.000000  175.300000   67.000000   27.200000
75%    377.500000  75679.000000  199.500000   70.000000   31.750000
max    503.000000  99701.000000  255.900000   79.000000   37.700000

In [10]:
treatments.describe() #some are not normal based on medical knowledge

       hba1c_start   hba1c_end  hba1c_change
count   280.000000  280.000000    171.000000
mean      7.985929    7.589286      0.546023
std       0.568638    0.569672      0.279555
min       7.500000    7.010000      0.200000
25%       7.660000    7.270000      0.340000
50%       7.800000    7.420000      0.380000
75%       7.970000    7.570000      0.920000
max       9.950000    9.580000      0.990000

In [11]:
patients.sample(5)

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,contact,birthdate,weight,height,bmi
219,220,male,Mỹ,Quynh,NaN,NaN,NaN,NaN,NaN,NaN,4/9/1978,237.8,69,35.1
252,253,male,Juan,Pérez,2549 Pearlman Avenue,Bedford,MA,1730.0,United States,978-243-8596JuanPerez@teleworm.us,10/1/1991,224.2,70,32.2
52,53,female,Brianna,Lansell,1389 Nutters Barn Lane,Urbandale,IA,50322.0,United States,515-727-9324BriannaLansell@fleckens.hu,12/4/1950,202.0,62,36.9
53,54,male,Kwemtochukwu,Ogochukwu,2172 Lynn Street,Franklin,MA,2038.0,United States,617-317-5055KwemtochukwuOgochukwu@einrot.com,6/30/1976,150.5,72,20.4
330,331,male,Vasco,van de Wiel,2691 Kessla Way,Pritchardville,SC,29902.0,United States,VascovandeWiel@rhyta.com+1 (843) 368-5129,1/3/1981,153.8,72,20.9

In [12]:
patients.surname.value_counts()

Doe         6
Taylor      3
Jakobsen    3
Correia     2
Hueber      2
           ..
Horikawa    1
Mensa       1
Henzen      1
Ruais       1
Fakhoury    1
Name: surname, Length: 466, dtype: int64

In [13]:
patients.address.value_counts()

123 Main Street              6
2778 North Avenue            2
648 Old Dear Lane            2
2476 Fulton Street           2
3084 Blue Spruce Lane        1
                            ..
2102 Geraldine Lane          1
1147 Kelley Road             1
288 Colony Street            1
3180 Still Pastures Drive    1
666 Whiteman Street          1
Name: address, Length: 483, dtype: int64

In [14]:
patients[patients.address.duplicated()]

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,contact,birthdate,weight,height,bmi
29,30,male,Jake,Jakobsen,648 Old Dear Lane,Port Jervis,New York,12771.0,United States,JakobCJakobsen@einrot.com+1 (845) 858-7707,8/1/1985,155.8,67,24.4
219,220,male,Mỹ,Quynh,NaN,NaN,NaN,NaN,NaN,NaN,4/9/1978,237.8,69,35.1
229,230,male,John,Doe,123 Main Street,New York,NY,12345.0,United States,johndoe@email.com1234567890,1/1/1975,180.0,72,24.4
230,231,female,Elisabeth,Knudsen,NaN,NaN,NaN,NaN,NaN,NaN,9/23/1976,165.9,63,29.4
234,235,female,Martina,Tománková,NaN,NaN,NaN,NaN,NaN,NaN,4/7/1936,199.5,65,33.2
237,238,male,John,Doe,123 Main Street,New York,NY,12345.0,United States,johndoe@email.com1234567890,1/1/1975,180.0,72,24.4
242,243,male,John,O'Brian,NaN,NaN,NaN,NaN,NaN,NaN,2/25/1957,205.3,74,26.4
244,245,male,John,Doe,123 Main Street,New York,NY,12345.0,United States,johndoe@email.com1234567890,1/1/1975,180.0,72,24.4
249,250,male,Benjamin,Mehler,NaN,NaN,NaN,NaN,NaN,NaN,10/30/1951,146.5,69,21.6
251,252,male,John,Doe,123 Main Street,New York,NY,12345.0,United States,johndoe@email.com1234567890,1/1/1975,180.0,72,24.4
257,258,male,Jin,Kung,NaN,NaN,NaN,NaN,NaN,NaN,5/17/1995,231.7,69,34.2
264,265,female,Wafiyyah,Asfour,NaN,NaN,NaN,NaN,NaN,NaN,11/3/1989,158.6,63,28.1
269,270,female,Flavia,Fiorentino,NaN,NaN,NaN,NaN,NaN,NaN,10/9/1937,175.2,61,33.1
277,278,male,John,Doe,123 Main Street,New York,NY,12345.0,United States,johndoe@email.com1234567890,1/1/1975,180.0,72,24.4
278,279,female,Generosa,Cabán,NaN,NaN,NaN,NaN,NaN,NaN,12/16/1962,124.3,69,18.4
282,283,female,Sandy,Taylor,2476 Fulton Street,Rainelle,WV,25962.0,United States,304-438-2648SandraCTaylor@dayrep.com,10/23/1960,206.1,64,35.4
286,287,male,Lewis,Webb,NaN,NaN,NaN,NaN,NaN,NaN,4/1/1979,155.3,68,23.6
296,297,female,Chỉ,Lâm,NaN,NaN,NaN,NaN,NaN,NaN,5/14/1990,181.1,63,32.1
502,503,male,Pat,Gersten,2778 North Avenue,Burr,Nebraska,68324.0,United States,PatrickGersten@rhyta.com402-848-4923,5/3/1954,138.2,71,19.3

In [15]:
patients.weight.sort_values()
#48 isn't normal , lets check if the data entry personnel entered kg?

210     48.8
459    102.1
335    102.7
74     103.2
317    106.0
       ...
144    244.9
61     244.9
283    245.5
118    254.5
485    255.9
Name: weight, Length: 503, dtype: float64

In [16]:
weight_lbs = patients[patients.surname == 'Zaitseva'].weight * 2.20462 #to kg
height_in = patients[patients.surname == 'Zaitseva'].height
bmi_check = 703 * weight_lbs / (height_in * height_in)
bmi_check

210    19.055827
dtype: float64

In [17]:
patients[patients.surname == 'Zaitseva'].bmi #seems right

210    19.1
Name: bmi, dtype: float64

In [18]:
sum(treatments.auralin.isnull()) # shoud have nulls (rather that -)

0

In [19]:
sum(treatments.novodra.isnull())# shoud have nulls (rather that -)

0

#### Quality
##### `patients` table
- Zip code is a float not a string
- Zip code has four digits sometimes
- Tim Neudorf height is 27 in instead of 72 in
- Full state names sometimes, abbreviations other times
- Dsvid Gustafsson
- Missing demographic information (address - contact columns) ***(can't clean)***
- Erroneous datatypes (assigned sex, state, zip_code, and birthdate columns)
- Multiple phone number formats
- Default John Doe data
- Multiple records for Jakobsen, Gersten, Taylor
- kgs instead of lbs for Zaitseva weight

##### `treatments` table
- Missing HbA1c changes
- The letter 'u' in starting and ending doses for Auralin and Novodra
- Lowercase given names and surnames
- Missing records (280 instead of 350)
- Erroneous datatypes (auralin and novodra columns)
- Inaccurate HbA1c changes (leading 4s mistaken as 9s)
- Nulls represented as dashes (-) in auralin and novodra columns

##### `adverse_reactions` table
- Lowercase given names and surnames

#### Tidiness
- Contact column in `patients` table should be split into phone number and email
- Three variables in two columns in `treatments` table (treatment, start dose and end dose)
- Adverse reaction should be part of the `treatments` table
- Given name and surname columns in `patients` table duplicated in `treatments` and `adverse_reactions` tables

## Clean

In [20]:
#important 
patients_clean = patients.copy()
treatments_clean = treatments.copy()
adverse_reactions_clean = adverse_reactions.copy()

## Missing Data
I will start with missing data first! important<br>
Define, Code, and Test sequences<br>

### `Treatments` : Missing records (280 instead of 350)
<br>the missing `treatments` records are stored in a file named `treatments_cut.csv`

##### Define

Add missing data of treatments using pd.concat([df1,df2]) function

##### Code

In [21]:
treatments_cut = pd.read_csv('treatments_cut.csv')
treatments_clean = pd.concat([treatments_clean,treatments_cut],ignore_index=True)

##### Test

In [22]:
treatments_clean.shape

(350, 7)

In [23]:
treatments_clean.head()

,given_name,surname,auralin,novodra,hba1c_start,hba1c_end,hba1c_change
0,veronika,jindrová,41u - 48u,-,7.63,7.20,NaN
1,elliot,richardson,-,40u - 45u,7.56,7.09,0.97
2,yukitaka,takenaka,-,39u - 36u,7.68,7.25,NaN
3,skye,gormanston,33u - 36u,-,7.97,7.62,0.35
4,alissa,montez,-,33u - 29u,7.78,7.46,0.32

### `treatments`: Missing HbA1c changes and Inaccurate HbA1c changes (leading 4s mistaken as 9s)
*Note: the "Inaccurate HbA1c changes (leading 4s mistaken as 9s)" observation, which is an accuracy issue and not a completeness issue, is included in this header because it is also fixed by the cleaning operation that fixes the missing "Missing HbA1c changes" observation.

##### Define

Fill the missing hba1c_change column values, by sbtracr hba1c_start - hba1c_end

##### Code

In [24]:
treatments_clean.hba1c_change = (treatments_clean.hba1c_start - 
                                 treatments_clean.hba1c_end)

##### Test

In [25]:
treatments_clean.head()

,given_name,surname,auralin,novodra,hba1c_start,hba1c_end,hba1c_change
0,veronika,jindrová,41u - 48u,-,7.63,7.20,0.43
1,elliot,richardson,-,40u - 45u,7.56,7.09,0.47
2,yukitaka,takenaka,-,39u - 36u,7.68,7.25,0.43
3,skye,gormanston,33u - 36u,-,7.97,7.62,0.35
4,alissa,montez,-,33u - 29u,7.78,7.46,0.32

In [26]:
treatments_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   given_name    350 non-null    object
 1   surname       350 non-null    object
 2   auralin       350 non-null    object
 3   novodra       350 non-null    object
 4   hba1c_start   350 non-null    float64
 5   hba1c_end     350 non-null    float64
 6   hba1c_change  350 non-null    float64
dtypes: float64(3), object(4)
memory usage: 19.3+ KB

## Tidiness 
Second is untidy data, important<br>
proved to make cleaning easier when **structural brfore** the quality issues ;)<br>
Define, Code, and Test sequences<br>

#### Contact column in `patients` table contains two variables: phone number and email

##### Define

Extract the *phone number* and *email* variables from the *contact* column using regular expressions and pandas' `str.extract` method. Drop the *contact* column when done.

this pattern worked with me  for phones : 
`1?[(]?(\d{3})[)]?[\s-]?(\d{3})[\s-](\d{4})`<br>but there were 6 extra nulls; those for rung entries 123456789 for the same duplicated person<br>

and this pattern worked with me for email : 
`r"([a-zA-Z]+@[a-zA-Z0-9-]+\.[a-zA-Z0-9-.]{1,5})"` <br>
However I use different patterns


<br>This breaks down into:
- the country code '1?'
- the captured area code '\(?(\d{3})\)?', 
- and the rest of the digits '\d{3}' and '\d{4}' respectively. 
- I use '[\s-]?' to catch the space or dashes between each component

##### Code

In [27]:
patients_clean['phone'] = patients_clean.contact.str.extract('((?:\+\d{1,2}\s)?\(?\d{3}\)?[\s.-]?\d{3}[\s.-]?\d{4})', expand=True)
patients_clean['email'] = patients_clean.contact.str.extract('([a-zA-Z][a-zA-Z0-9_.+-]+@[a-zA-Z0-9-]+\.[a-zA-Z0-9-.]+[a-zA-Z])', expand=True)
patients_clean = patients_clean.drop('contact', axis=1)

##### Test

In [28]:
patients_clean.head()

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,phone,email
0,1,female,Zoe,Wellish,576 Brown Bear Drive,Rancho California,California,92390.0,United States,7/10/1976,121.7,66,19.6,951-719-9170,ZoeWellish@superrito.com
1,2,female,Pamela,Hill,2370 University Hill Road,Armstrong,Illinois,61812.0,United States,4/3/1967,118.8,66,19.2,+1 (217) 569-3204,PamelaSHill@cuvox.de
2,3,male,Jae,Debord,1493 Poling Farm Road,York,Nebraska,68467.0,United States,2/19/1980,177.8,71,24.8,402-363-6804,JaeMDebord@gustr.com
3,4,male,Liêm,Phan,2335 Webster Street,Woodbridge,NJ,7095.0,United States,7/26/1951,220.9,70,31.7,+1 (732) 636-8246,PhanBaLiem@jourrapide.com
4,5,male,Tim,Neudorf,1428 Turkey Pen Lane,Dothan,AL,36303.0,United States,2/18/1928,192.3,27,26.1,334-515-7487,TimNeudorf@cuvox.de

In [29]:
patients_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 503 entries, 0 to 502
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   patient_id    503 non-null    int64
 1   assigned_sex  503 non-null    object
 2   given_name    503 non-null    object
 3   surname       503 non-null    object
 4   address       491 non-null    object
 5   city          491 non-null    object
 6   state         491 non-null    object
 7   zip_code      491 non-null    float64
 8   country       491 non-null    object
 9   birthdate     503 non-null    object
 10  weight        503 non-null    float64
 11  height        503 non-null    int64
 12  bmi           503 non-null    float64
 13  phone         491 non-null    object
 14  email         491 non-null    object
dtypes: float64(3), int64(2), object(10)
memory usage: 59.1+ KB

In [30]:
patients_clean[patients_clean.phone.isnull()]

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,phone,email
209,210,female,Lalita,Eldarkhanov,NaN,NaN,NaN,NaN,NaN,8/14/1950,143.4,62,26.2,NaN,NaN
219,220,male,Mỹ,Quynh,NaN,NaN,NaN,NaN,NaN,4/9/1978,237.8,69,35.1,NaN,NaN
230,231,female,Elisabeth,Knudsen,NaN,NaN,NaN,NaN,NaN,9/23/1976,165.9,63,29.4,NaN,NaN
234,235,female,Martina,Tománková,NaN,NaN,NaN,NaN,NaN,4/7/1936,199.5,65,33.2,NaN,NaN
242,243,male,John,O'Brian,NaN,NaN,NaN,NaN,NaN,2/25/1957,205.3,74,26.4,NaN,NaN
249,250,male,Benjamin,Mehler,NaN,NaN,NaN,NaN,NaN,10/30/1951,146.5,69,21.6,NaN,NaN
257,258,male,Jin,Kung,NaN,NaN,NaN,NaN,NaN,5/17/1995,231.7,69,34.2,NaN,NaN
264,265,female,Wafiyyah,Asfour,NaN,NaN,NaN,NaN,NaN,11/3/1989,158.6,63,28.1,NaN,NaN
269,270,female,Flavia,Fiorentino,NaN,NaN,NaN,NaN,NaN,10/9/1937,175.2,61,33.1,NaN,NaN
278,279,female,Generosa,Cabán,NaN,NaN,NaN,NaN,NaN,12/16/1962,124.3,69,18.4,NaN,NaN
286,287,male,Lewis,Webb,NaN,NaN,NaN,NaN,NaN,4/1/1979,155.3,68,23.6,NaN,NaN
296,297,female,Chỉ,Lâm,NaN,NaN,NaN,NaN,NaN,5/14/1990,181.1,63,32.1,NaN,NaN

In [31]:
sum(patients_clean.phone.isnull())

12

In [32]:
sum(patients_clean.email.isnull())

12

In [33]:
list(patients_clean)

['patient_id',
 'assigned_sex',
 'given_name',
 'surname',
 'address',
 'city',
 'state',
 'zip_code',
 'country',
 'birthdate',
 'weight',
 'height',
 'bmi',
 'phone',
 'email']

In [34]:
patients_clean.phone.sample(10)

187    773-607-2647
370    508-821-2421
10     906-478-8949
386    408-215-6012
319    701-235-3404
180    318-417-5739
87     320-272-4299
335    765-359-0147
260    925-757-6139
31     423-538-4887
Name: phone, dtype: object

In [35]:
patients_clean.email.sample(10)

409     AlbikaIbragimov@superrito.com
131          SandraCTaylor@dayrep.com
491    VanessaFerguson@jourrapide.com
91     CarolineTShuler@jourrapide.com
273      MackenzieMcKay@superrito.com
5        RafaelCardosoCosta@gustr.com
171        BlagicaKlobucar@einrot.com
316          BuiQuynhChan@fleckens.hu
242                               NaN
275            EddieAArcher@gustr.com
Name: email, dtype: object

In [36]:
# Confirm that no emails start with an integer (reg-ex didn't match for this)
patients_clean.email.sort_values().head(10)

404               AaliyahRice@dayrep.com
11          Abdul-NurMummarIsa@rhyta.com
332                AbelEfrem@fleckens.hu
258              AbelYonatan@teleworm.us
305    AddolorataLombardi@jourrapide.com
118         AdibMutazzGhanem@fleckens.hu
420              AdlanShishani@gustr.com
238        AkselHVestergaard@armyspy.com
61                  AlanMilne@dayrep.com
130          AlbertRWolfe@jourrapide.com
Name: email, dtype: object

#### Three variables in two columns in `treatments` table (treatment, start dose and end dose)

##### Define
- Add `treatment` column which values are either auralin or novodra
- Add `start_dose` column which values are the first part number
- Add `end_dose` column which values are the second part number
- Drop `auralin` and `novodra` columns

I will use pandas' [melt function](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.melt.html) <br>
and [`str.split()` method](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.str.split.html). <br>
Here is an excellent [`melt` tutorial](https://deparkes.co.uk/2016/10/28/reshape-pandas-data-with-melt/).*

##### Code

In [37]:
# Add treatment column
# treatments_clean['treatment'] = 'unknown'
# i = 0 
# for value in treatments_clean['auralin']:
#     if value == '-':
#         treatments_clean['treatment'][i] = 'novodra'
#     else:
#         treatments_clean['treatment'][i] = 'auralin'
#     i = i+1

In [38]:
# Add start_dose column part I

# treatments_clean['start_dose'] = 'unknown'
# i = 0
# for value in treatments_clean['auralin']:
#     if value != '-':
#         treatments_clean['start_dose'][i] = treatments_clean['auralin'][i][:2]
#     i = i+1

In [39]:
# Add start_dose column part II
# j = 0 
# for value in treatments_clean['novodra']:
#     if value != '-':
#         treatments_clean['start_dose'][j] = treatments_clean['novodra'][j][:2]
#     j = j+1
    
# treatments_clean.head()

In [40]:
# Add end_dose column part I

# treatments_clean['end_dose'] = 'unknown'
# i = 0
# for value in treatments_clean['auralin']:
#     if value != '-':
#         treatments_clean['end_dose'][i] = treatments_clean['auralin'][i][5:8]
#     i = i+1
# treatments_clean.head()

In [41]:
# Add end_dose column part II
# j = 0
# for value in treatments_clean['novodra']:
#     if value != '-':
#         treatments_clean['end_dose'][j] = treatments_clean['novodra'][j][5:8]
#     j = j+1
# treatments_clean.head()

### However
#### there is easier way

##### Define
Melt the *auralin* and *novodra* columns to a *treatment* and a *dose* column (dose will still contain both start and end dose at this point). <br>
Then split the dose column on ' - ' to obtain *start_dose* and *end_dose* columns. <br>
Drop the intermediate *dose* column.

##### Code

In [42]:
treatments_clean = pd.melt(treatments_clean, id_vars=['given_name', 'surname', 'hba1c_start', 'hba1c_end', 'hba1c_change'],
                           var_name='treatment', value_name='dose')
treatments_clean.head()

,given_name,surname,hba1c_start,hba1c_end,hba1c_change,treatment,dose
0,veronika,jindrová,7.63,7.20,0.43,auralin,41u - 48u
1,elliot,richardson,7.56,7.09,0.47,auralin,-
2,yukitaka,takenaka,7.68,7.25,0.43,auralin,-
3,skye,gormanston,7.97,7.62,0.35,auralin,33u - 36u
4,alissa,montez,7.78,7.46,0.32,auralin,-

In [43]:
treatments_clean[treatments_clean.given_name == 'elliot']

,given_name,surname,hba1c_start,hba1c_end,hba1c_change,treatment,dose
1,elliot,richardson,7.56,7.09,0.47,auralin,-
351,elliot,richardson,7.56,7.09,0.47,novodra,40u - 45u

In [44]:
treatments_clean = treatments_clean[treatments_clean.dose != "-"]
treatments_clean.head()

,given_name,surname,hba1c_start,hba1c_end,hba1c_change,treatment,dose
0,veronika,jindrová,7.63,7.20,0.43,auralin,41u - 48u
3,skye,gormanston,7.97,7.62,0.35,auralin,33u - 36u
6,sophia,haugen,7.65,7.27,0.38,auralin,37u - 42u
7,eddie,archer,7.89,7.55,0.34,auralin,31u - 38u
9,asia,woźniak,7.76,7.37,0.39,auralin,30u - 36u

In [45]:
treatments_clean['dose_start'], treatments_clean['dose_end'] = treatments_clean['dose'].str.split(' - ', 1).str
treatments_clean.head()

<ipython-input-45-990b3277e92b>:1: FutureWarning: Columnar iteration over characters will be deprecated in future releases.
  treatments_clean['dose_start'], treatments_clean['dose_end'] = treatments_clean['dose'].str.split(' - ', 1).str

,given_name,surname,hba1c_start,hba1c_end,hba1c_change,treatment,dose,dose_start,dose_end
0,veronika,jindrová,7.63,7.20,0.43,auralin,41u - 48u,41u,48u
3,skye,gormanston,7.97,7.62,0.35,auralin,33u - 36u,33u,36u
6,sophia,haugen,7.65,7.27,0.38,auralin,37u - 42u,37u,42u
7,eddie,archer,7.89,7.55,0.34,auralin,31u - 38u,31u,38u
9,asia,woźniak,7.76,7.37,0.39,auralin,30u - 36u,30u,36u

In [46]:
treatments_clean = treatments_clean.drop('dose', axis=1)

##### Test

In [47]:
treatments_clean.head() #all auralin bc they are sorted, the rest are in the end

,given_name,surname,hba1c_start,hba1c_end,hba1c_change,treatment,dose_start,dose_end
0,veronika,jindrová,7.63,7.20,0.43,auralin,41u,48u
3,skye,gormanston,7.97,7.62,0.35,auralin,33u,36u
6,sophia,haugen,7.65,7.27,0.38,auralin,37u,42u
7,eddie,archer,7.89,7.55,0.34,auralin,31u,38u
9,asia,woźniak,7.76,7.37,0.39,auralin,30u,36u

#### Adverse reaction should be part of the `treatments` table

##### Define
Merge the adverse_reaction column to the treatments table, joining on given name and surname.

##### Code

In [48]:
# treatments_clean = pd.concat([treatments_clean,adverse_reactions_clean]) #wrong
treatments_clean = pd.merge(treatments_clean, adverse_reactions_clean,
                            on=['given_name', 'surname'], how='left')

##### Test

In [49]:
treatments_clean

,given_name,surname,hba1c_start,hba1c_end,hba1c_change,treatment,dose_start,dose_end,adverse_reaction
0,veronika,jindrová,7.63,7.20,0.43,auralin,41u,48u,NaN
1,skye,gormanston,7.97,7.62,0.35,auralin,33u,36u,NaN
2,sophia,haugen,7.65,7.27,0.38,auralin,37u,42u,NaN
3,eddie,archer,7.89,7.55,0.34,auralin,31u,38u,NaN
4,asia,woźniak,7.76,7.37,0.39,auralin,30u,36u,NaN
...,...,...,...,...,...,...,...,...,...
345,christopher,woodward,7.51,7.06,0.45,novodra,55u,51u,nausea
346,maret,sultygov,7.67,7.30,0.37,novodra,26u,23u,NaN
347,lixue,hsueh,9.21,8.80,0.41,novodra,22u,23u,injection site discomfort
348,jakob,jakobsen,7.96,7.51,0.45,novodra,28u,26u,hypoglycemia
349,berta,napolitani,7.68,7.21,0.47,novodra,42u,44u,injection site discomfort

#### Given name and surname columns in `patients` table duplicated in `treatments` and `adverse_reactions` tables  and Lowercase given names and surnames

##### Define

- **drop/ignore adverse reactions table** <br>
Adverse reactions table is no longer needed so ignore that part. <br>

- **drop names in treatments table and include only id**<br>
Isolate the patient ID and names in the `patients` table,<br> 
Convert these names to lower case to: <br>
join with `treatments` <br>
Drop the given name and surname columns in the treatments table <br>
(so these being lowercase isn't an issue anymore)

##### Code

In [50]:
patients_clean.head(2)

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,phone,email
0,1,female,Zoe,Wellish,576 Brown Bear Drive,Rancho California,California,92390.0,United States,7/10/1976,121.7,66,19.6,951-719-9170,ZoeWellish@superrito.com
1,2,female,Pamela,Hill,2370 University Hill Road,Armstrong,Illinois,61812.0,United States,4/3/1967,118.8,66,19.2,+1 (217) 569-3204,PamelaSHill@cuvox.de

In [51]:
patients_clean_names = patients_clean[['patient_id','given_name','surname']]
patients_clean_names

     patient_id given_name      surname
0             1        Zoe      Wellish
1             2     Pamela         Hill
2             3        Jae       Debord
3             4       Liêm         Phan
4             5        Tim      Neudorf
..          ...        ...          ...
498         499    Mustafa    Lindström
499         500      Ruman      Bisliev
500         501      Jinke    de Keizer
501         502    Chidalu  Onyekaozulu
502         503        Pat      Gersten

[503 rows x 3 columns]

In [52]:
patients_clean_names.given_name = patients_clean_names.given_name.str.lower();
patients_clean_names.surname = patients_clean_names.surname.str.lower();

/Users/tamimisu/opt/anaconda3/lib/python3.8/site-packages/pandas/core/generic.py:5303: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [53]:
patients_clean_names.head()

   patient_id given_name  surname
0           1        zoe  wellish
1           2     pamela     hill
2           3        jae   debord
3           4       liêm     phan
4           5        tim  neudorf

In [54]:
treatments_clean = treatments_clean.merge(patients_clean_names, on=['given_name', 'surname'])

In [55]:
treatments_clean = treatments_clean.drop(['given_name', 'surname'],axis=1)

##### Test

In [56]:
treatments_clean.head()

,hba1c_start,hba1c_end,hba1c_change,treatment,dose_start,dose_end,adverse_reaction,patient_id
0,7.63,7.20,0.43,auralin,41u,48u,NaN,225
1,7.97,7.62,0.35,auralin,33u,36u,NaN,242
2,7.65,7.27,0.38,auralin,37u,42u,NaN,345
3,7.89,7.55,0.34,auralin,31u,38u,NaN,276
4,7.76,7.37,0.39,auralin,30u,36u,NaN,15

In [57]:
# Patient ID should be the only duplicate column
all_columns = pd.Series(list(patients_clean) + list(treatments_clean))
all_columns[all_columns.duplicated()]

22    patient_id
dtype: object

### Quality

#### Zip code is a float not a string and Zip code has four digits sometimes

##### Define

convert to str <br> remove .0 last part using string slicing<br>
pad a zero in the begining if four

##### Code

In [58]:
patients_clean.zip_code = patients_clean.zip_code.astype(str).str[:-2].str.pad(5, fillchar='0')

In [59]:
patients_clean.zip_code.value_counts()

0000n    12
12345     6
30303     4
10004     4
01730     3
         ..
78401     1
95826     1
49738     1
44691     1
62234     1
Name: zip_code, Length: 431, dtype: int64

In [60]:
# Reconvert NaNs entries that were converted to '0000n' by code above
patients_clean.zip_code = patients_clean.zip_code.replace('0000n', np.nan)

##### Test

In [61]:
patients_clean.head()

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,phone,email
0,1,female,Zoe,Wellish,576 Brown Bear Drive,Rancho California,California,92390,United States,7/10/1976,121.7,66,19.6,951-719-9170,ZoeWellish@superrito.com
1,2,female,Pamela,Hill,2370 University Hill Road,Armstrong,Illinois,61812,United States,4/3/1967,118.8,66,19.2,+1 (217) 569-3204,PamelaSHill@cuvox.de
2,3,male,Jae,Debord,1493 Poling Farm Road,York,Nebraska,68467,United States,2/19/1980,177.8,71,24.8,402-363-6804,JaeMDebord@gustr.com
3,4,male,Liêm,Phan,2335 Webster Street,Woodbridge,NJ,07095,United States,7/26/1951,220.9,70,31.7,+1 (732) 636-8246,PhanBaLiem@jourrapide.com
4,5,male,Tim,Neudorf,1428 Turkey Pen Lane,Dothan,AL,36303,United States,2/18/1928,192.3,27,26.1,334-515-7487,TimNeudorf@cuvox.de

## Problem 2
### Tim Neudorf height is 27 in instead of 72 inch

##### Define
Replace height for rows in the `patients` table that have a height of 27 in (there is only one) with 72 in.

##### Code

In [62]:
patients_clean.height = patients_clean.height.replace(27, 72)

##### Test

In [63]:
patients_clean[patients_clean['height']==27]

Empty DataFrame
Columns: [patient_id, assigned_sex, given_name, surname, address, city, state, zip_code, country, birthdate, weight, height, bmi, phone, email]
Index: []

In [64]:
# Confirm the replacement worked
patients_clean[patients_clean.surname == 'Neudorf']

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,phone,email
4,5,male,Tim,Neudorf,1428 Turkey Pen Lane,Dothan,AL,36303,United States,2/18/1928,192.3,72,26.1,334-515-7487,TimNeudorf@cuvox.de

## Problem 3
Full state names sometimes, abbreviations other times :)

##### Define
converts full state name to state abbreviation for 
- California
- New York
- Illinois
- Florida
- Nebraska.

##### Code

In [65]:
patients_clean.state.value_counts()

California    36
TX            32
New York      25
CA            24
NY            22
MA            22
PA            18
GA            15
Illinois      14
OH            14
MI            13
OK            13
LA            13
Florida       13
NJ            12
VA            11
MS            10
IL            10
WI            10
IN             9
MN             9
AL             9
FL             9
TN             9
KY             8
WA             8
NC             8
MO             7
NV             6
KS             6
ID             6
IA             5
CT             5
SC             5
Nebraska       4
CO             4
ND             4
AR             4
AZ             4
ME             4
RI             4
WV             3
MD             3
SD             3
OR             3
DE             3
VT             2
NE             2
MT             2
DC             2
WY             1
AK             1
NH             1
NM             1
Name: state, dtype: int64

In [66]:
patients_clean.state = patients_clean.state.replace('California','CA')
patients_clean.state = patients_clean.state.replace('New York','NY')
patients_clean.state = patients_clean.state.replace('Florida','FL')
patients_clean.state = patients_clean.state.replace('Illinois','IL')
patients_clean.state = patients_clean.state.replace('Nebraska','NE')

##### Test

In [67]:
patients_clean.state.value_counts()

CA    60
NY    47
TX    32
IL    24
MA    22
FL    22
PA    18
GA    15
OH    14
MI    13
LA    13
OK    13
NJ    12
VA    11
MS    10
WI    10
AL     9
IN     9
MN     9
TN     9
KY     8
WA     8
NC     8
MO     7
NV     6
KS     6
ID     6
NE     6
SC     5
CT     5
IA     5
ME     4
ND     4
AZ     4
RI     4
CO     4
AR     4
WV     3
DE     3
SD     3
OR     3
MD     3
DC     2
MT     2
VT     2
WY     1
NM     1
AK     1
NH     1
Name: state, dtype: int64

## Problem 4
Dsvid Gustafsson

##### Define
Replace given name for rows in the `patients` table that have a given name of 'Dsvid' with 'David'.

##### Code

In [68]:
patients_clean.given_name.replace('Dsvid','David',inplace = True)

##### Test

In [69]:
patients_clean[patients_clean.given_name == 'Dsvid']

Empty DataFrame
Columns: [patient_id, assigned_sex, given_name, surname, address, city, state, zip_code, country, birthdate, weight, height, bmi, phone, email]
Index: []

In [70]:
patients_clean[patients_clean.surname == 'Gustafsson']

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,phone,email
8,9,male,David,Gustafsson,1790 Nutter Street,Kansas City,MO,64105,United States,3/6/1937,163.9,66,26.5,816-265-9578,DavidGustafsson@armyspy.com

## Problem 5
Erroneous datatypes (assigned sex, state, zip_code, and birthdate columns) 
<br> and Erroneous datatypes (auralin and novodra columns)
<br> and The letter 'u' in starting and ending doses for Auralin and Novodra

##### Define
Zip code data type was already addressed above. <br>
- Convert birthdate to datetime data type. 
- Strip the letter 'u' in start dose and end dose 
- Convert those columns to data type integer.
- Convert assigned sex and state to categorical data types.

##### Code

In [71]:
patients_clean.birthdate = pd.to_datetime(patients_clean.birthdate)

In [72]:
treatments_clean.dose_start = treatments_clean.dose_start.str.strip('u').astype(int)
treatments_clean.dose_end = treatments_clean.dose_end.str.strip('u').astype(int)

In [73]:
patients_clean.assigned_sex = patients_clean.assigned_sex.astype('category')
patients_clean.state = patients_clean.state.astype('category')

##### Test

In [74]:
treatments_clean.head()

,hba1c_start,hba1c_end,hba1c_change,treatment,dose_start,dose_end,adverse_reaction,patient_id
0,7.63,7.20,0.43,auralin,41,48,NaN,225
1,7.97,7.62,0.35,auralin,33,36,NaN,242
2,7.65,7.27,0.38,auralin,37,42,NaN,345
3,7.89,7.55,0.34,auralin,31,38,NaN,276
4,7.76,7.37,0.39,auralin,30,36,NaN,15

In [75]:
treatments_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 349 entries, 0 to 348
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   hba1c_start       349 non-null    float64
 1   hba1c_end         349 non-null    float64
 2   hba1c_change      349 non-null    float64
 3   treatment         349 non-null    object
 4   dose_start        349 non-null    int64
 5   dose_end          349 non-null    int64
 6   adverse_reaction  35 non-null     object
 7   patient_id        349 non-null    int64
dtypes: float64(3), int64(3), object(2)
memory usage: 24.5+ KB

In [76]:
patients_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 503 entries, 0 to 502
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   patient_id    503 non-null    int64
 1   assigned_sex  503 non-null    category
 2   given_name    503 non-null    object
 3   surname       503 non-null    object
 4   address       491 non-null    object
 5   city          491 non-null    object
 6   state         491 non-null    category
 7   zip_code      491 non-null    object
 8   country       491 non-null    object
 9   birthdate     503 non-null    datetime64[ns]
 10  weight        503 non-null    float64
 11  height        503 non-null    int64
 12  bmi           503 non-null    float64
 13  phone         491 non-null    object
 14  email         491 non-null    object
dtypes: category(2), datetime64[ns](1), float64(2), int64(2), object(8)
memory usage: 53.9+ KB

## Problem 6
Multiple phone number formats

##### Define
- Strip all " ", "-", "(", ")", and "+" 
- Store each number without any formatting. 
- Pad the phone number with a 1 if the length of the number is 10 digits 
(we want country code).

##### Code

In [77]:
patients_clean.phone = patients_clean.phone.str.replace(r'\D+', '').str.pad(11,fillchar='1')

##### Test

In [78]:
patients_clean.phone.head(10)

0    19517199170
1    12175693204
2    14023636804
3    17326368246
4    13345157487
5    13863345237
6    17755335933
7    14087783236
8    18162659578
9    17187959124
Name: phone, dtype: object

## Problem 7
Default John Doe data

##### Define
Remove the non-recoverable John Doe records from the `patients` table.

##### Code

In [79]:
sum(patients_clean.surname=='Doe')

6

In [80]:
patients_clean = patients_clean[patients_clean.surname != 'Doe']

##### Test

In [81]:
sum(patients_clean.surname=='Doe')

0

In [82]:
# Should be no Doe records (was 6)
patients_clean.surname.value_counts()

Taylor      3
Jakobsen    3
Cindrić     2
Lund        2
Collins     2
           ..
Horikawa    1
Mensa       1
Henzen      1
Ruais       1
Fakhoury    1
Name: surname, Length: 465, dtype: int64

In [83]:
# Should be no 123 Main Street records
patients_clean.address.value_counts()

2778 North Avenue            2
2476 Fulton Street           2
648 Old Dear Lane            2
2625 Romines Mill Road       1
4571 Walnut Hill Drive       1
                            ..
1147 Kelley Road             1
288 Colony Street            1
3180 Still Pastures Drive    1
4168 Coventry Court          1
666 Whiteman Street          1
Name: address, Length: 482, dtype: int64

## Problem 8
Multiple records for Jakobsen, Gersten, Taylor

##### Define
- Remove the Jake Jakobsen, Pat Gersten, and Sandy Taylor rows from the `patients` table
- These are the nicknames, which happen to also not be in the `treatments` table (removing the wrong name would create a consistency issue between the `patients` and `treatments` table). 
- These are all the second occurrence of the duplicate. 
- These are also the only occurences of non-null duplicate addresses.

##### Code

In [84]:
patients_clean = patients_clean[~((patients_clean.address.duplicated()) & patients_clean.address.notnull())]

##### Test

In [85]:
patients_clean[patients_clean.surname == 'Taylor']

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,phone,email
131,132,female,Sandra,Taylor,2476 Fulton Street,Rainelle,WV,25962,United States,1960-10-23,206.1,64,35.4,13044382648,SandraCTaylor@dayrep.com
426,427,male,Rogelio,Taylor,4064 Marigold Lane,Miami,FL,33179,United States,1992-09-02,186.6,69,27.6,13054346299,RogelioJTaylor@teleworm.us

In [86]:
patients_clean[patients_clean.surname == 'Gersten']

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,phone,email
97,98,male,Patrick,Gersten,2778 North Avenue,Burr,NE,68324,United States,1954-05-03,138.2,71,19.3,14028484923,PatrickGersten@rhyta.com

In [87]:
patients_clean[patients_clean.surname == 'Jakobsen']

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,phone,email
24,25,male,Jakob,Jakobsen,648 Old Dear Lane,Port Jervis,NY,12771,United States,1985-08-01,155.8,67,24.4,18458587707,JakobCJakobsen@einrot.com
432,433,female,Karen,Jakobsen,1690 Fannie Street,Houston,TX,77020,United States,1962-11-25,185.2,67,29.0,19792030438,KarenJakobsen@jourrapide.com

## Problem 9
kgs instead of lbs for Zaitseva weight

##### Define

- Isolate the row where the surname is Zaitseva 
- Convert the entry in its weight field from kg to lbs.

##### Code

In [88]:
weight_kg = patients_clean.weight.min()
mask = patients_clean.surname == 'Zaitseva'
column_name = 'weight'
weight_kg

48.8

In [89]:
patients_clean.loc[mask, column_name] = weight_kg * 2.20462

##### Test

In [90]:
patients_clean.weight.min()

102.1

In [91]:
# 48.8 shouldn't be the lowest anymore
patients_clean.weight.sort_values()

459    102.1
335    102.7
74     103.2
317    106.0
171    106.5
       ...
144    244.9
61     244.9
283    245.5
118    254.5
485    255.9
Name: weight, Length: 494, dtype: float64